Repository: DVSProductions/AlienTek-Firmware-Upgrade-Tool
Catalog: UI.*.resx
Languages: de, zh

source: Firmware Information OK
zh: 固件信息 OK

source: Firmware Download Failed
de: Firmware konnte nicht heruntergeladen werden
zh: 固件下载失败

source: Firmware information abnormality
de: Firmware Information ungültig
zh: 固件信息异常

source: Flashing Failed
de: Übertragung Fehlgeschlagen
zh: 刷机失败

source: Loading Firmware
de: Lese Firmware ein
zh: 加载固件

source: Start abnormal
de: Start fehlgeschlagen
zh: 开始异常

source: Start OK
de: Start erfolgreich
zh: 开始 OK

source: End instruction exception
de: Ausnahme beim beenden des Vorgangs
zh: 结束指令异常

source: End OK
de: Erfolgreich Beeendet
zh: 结束 OK

# ExceptionGettingDeviceInformation
source: Exception in getting device information
de: Ausnahme beim Einlesen der Geräteinformationen
zh: 获取设备信息异常

source: Get device information OK
de: Geräteinformationen eingelesen
zh: 获取设备信息

source: Get device status
de: Rufe Gerätestatus ab
zh: 获取设备状态

# BootloaderReconnecting
source: Equipment entry Bootloader，Reconnecting......
de: Gerät läd Bootloader，Wiederverbindung....
zh: 设备进入 Bootloader，重新连接中......

# FirmwareModelMismatch
source: Selected firmware is not compatible with this Device
de: Diese Firmware ist nicht mit diesem Gerät kompatibel
zh: 所选固件与此设备不兼容

source: Failure Receiving Device Info
de: Geräteinformationen konnten nicht empfangen werden
zh: 接收设备信息失败

source: Firmware file not found
de: Firmware Datei konnte nicht gefunden werden
zh: 未找到固件文件

# ConnectionNotOpen
source: Connection Not Open. Did you disconnect the device?
de: Verbindung geschlossen. Ist das Gerät getrennt?
zh: 连接未打开。您是否断开了设备连接？

# BackBtn
source: ← Back
de: ← Zurück
zh: ← 后退

# WindowTitle
source: AlienTek Firmware Upgrade
de: AlienTek Firmware Aktualiserung
zh: AlienTek 固件升级

# UpgradeSuccessful
source: Firmware Upgrade Successful!
de: Firmware Aktualisierung Erfolgreich!
zh: 固件升级成功！

# UpgradeFailed
source: Firmware Upgrade Failed!
de: Firmware Aktualisierung Fehlgeschlagen!
zh: 固件升级失败！

# btStartOver
source: Start Over
de: Neu Anfangen
zh: 重新开始

# btRetry
source: Retry / See Log
de: Erneut Versuchen / Log einsehen
zh: 重试/查看日志

source: Detected Devices
de: Erkannte Geräte
zh: 检测到的设备

# btRefresh
source: Refresh
de: Aktualisieren
zh: 刷新

# btNext
source: Next
de: Weiter
zh: 下一个

# btFlashFirmware
source: Flash Firmware
de: Firmware Übertragen
zh: 闪存固件

# btDownload
source: Download Upgrade From Server
de: Firmware von Server Herunterladen
zh: 从服务器下载升级

# btPickFile
source: Pick Local Firmware File
de: Lokale Firmware auswählen
zh: 选择本地固件文件

# FileDialogFilename
source: ATK File|*.atk
de: ATK Datei|*.atk
zh: ATK 文件|*.atk

# ConntectedAs
source: Connected as
de: Verbunden als
zh: 连接为

source: via
de: über
zh: 通过

# MSGTitleError
source: Error
de: Fehler
zh: 提示

# DeviceNotConnected
source: The device is not connected or has been disconnected, please reconnect
de: Das Gerät ist nicht verbunden oder wurde getrennt. Bitte verbinden sie es erneut.
zh: 设备未连接或者已断开，请重新连接

source: Data anomalies
de: Ungültige Daten
zh: 数据异常

# GetDeviceInfoError
source: Error Getting Device Info
de: Geräteinformationen konnten nicht eingelesen werden
zh: 获取设备信息时出错

# P1Title
source: Firmware Upgrade Tool for AlienTek T80 and T80D Soldering Irons
de: Firmware Upgrade Tool für AlienTek T80 und T80D Lötkolben
zh: 适用于 AlienTek T80 和 T80D 烙铁的固件升级工具

# btGetStarted
source: Get Started
de: Los
zh: 开始

# ConnectionInstructionStep1
source: 1. Press and hold the button closest to the Screen
de: 1. Drücken Sie den Knopf neben dem Bildschirm
zh: 1. 按住最靠近屏幕的按钮

# ConnectionInstructionStep2
source: 2. Connect the soldering iron with a data cable to this Computer
de: 2. Verbinden Sie den Lötkolben mithilfe eines Datenkabels mit Ihrem Computer
zh: 2. 使用数据线将烙铁连接到计算机

# P2Title
source: Connecting The Device
de: Gerät Verbinden
zh: 连接设备

# AboutTitle
source: AlienTek Firmware Upgrade Tool
zh: AlienTek 固件升级工具

# AboutApp
source: App written by
de: App entwickelt von
zh: 应用程序编写者

# AboutProtocol
source: Parts of the underlying protocol are based on the original AlienTek Firmware Upgrade Tool
de: Teile des zugrundeliegenden Protokolls basieren auf dem originalen AlienTek Firmware Upgrade Tool
zh: 底层协议的部分内容基于原始的 AlienTek 固件升级工具

# AboutVisit
source: Visit them at
de: Besuchen Sie sie auf
zh: 访问他们的网站

# btAbout
source: About
de: Über
zh: 关于
